
/*
  Localizable.string.strings
  WeChatMac

  Created by Justin Yim on 2/16/15.
  Copyright (c) 2015 Tencent. All rights reserved.
*/

"App.Name" = "WeChat";

"Common.Dialog.OK" = "OK";
"Common.Dialog.Cancel" = "Cancel";
"Common.Navigation.Back" = "Back";
"Common.Cancel" = "Cancel";
"Common.Delete" = "Delete";
"Common.Send" = "OK";

// Main Window
"MainWindow.Title.Format" = "WeChat (%@)";
"MainWindow.Title.NoChildTitle" = "WeChat";

// Common Errors
"Common.System.GenericErrorHeading" = "An error occurred.";
"Common.System.GenericErrorBody" = "Try again later.";
"Common.System.Busy" = "System busy. Try again later.";
"Common.Dialog.SaveError.Heading" = "An error occurred saving this file";
"Common.Dialog.SaveError.Body" = "Make sure you have enough disk space and permissions to the place you're saving to.";

// Chatlog backup
"Chatlog_Backup_Backup_Connecting_Title" = "Connecting phone…";
"Chatlog_Backup_Backup_Connecting_Desc" = "Connecting phone and computer to the same network";
"Chatlog_Backup_Backup_Connected_Title" = "Open WeChat on phone";
"Chatlog_Backup_Backup_Connected_Desc" = "Select chats to back up";
"Chatlog_Backup_Backup_Prepare_Title" = "Preparing data…";
"Chatlog_Backup_Backup_Prepare_Desc" = "For a more reliable network connection, do not close WeChat.";
"Chatlog_Backup_Backup_Transfer_Title" = "Backing up %lld/%lld chat(s) (%@)";
"Chatlog_Backup_Backup_Transfer_Desc" = "For a more reliable network connection, do not close WeChat.";
"Chatlog_Backup_Backup_Import_Data_Title" = "Importing backups";
"Chatlog_Backup_Backup_Import_Data_Desc" = "To back up completely, do not close page.";
"Chatlog_Backup_Backup_Finish_Title" = "Completed";
"Chatlog_Backup_Backup_Finish_Desc" = "%lld/%lld chat(s) backed up";

"Chatlog_Backup_Backup_Finish_Btn_Title" = "Done";
"Chatlog_Backup_Backup_Continue_Btn_Title" = "Continue";
"Chatlog_Backup_Backup_Terminate_Btn_Title" = "Terminate";
"Chatlog_Backup_Backup_End_Btn_Title" = "Backup Complete";
"Chatlog_Backup_Backup_Retry_Btn_Title" = "Retry";
"Chatlog_Backup_Backup_Confirm_Btn_Title" = "OK";
"Chatlog_Backup_Backup_Cancel_Btn_Title" = "Cancel";
"Chatlog_Backup_Backup_Return_Btn_Title" = "Back";

"Chatlog_Backup_Backup_Transfer_Disconnect_Title" = "Backing up %lld/%lld chat(s) (%@)";
"Chatlog_Backup_Backup_Transfer_Disconnect_Hint" = "Network disconnected. Connect phone and computer to the same network and continue transfer";
"Chatlog_Backup_Backup_Connect_Timeout_Title" = "Connection timeout. Try again.";
"Chatlog_Backup_Backup_Connect_Timeout_Hint" = "After connecting phone and computer to the same network";
"Chatlog_Backup_Backup_Transfer_Unfinish_Title" = "Transferred %lld/%lld chats…";
"Chatlog_Backup_Backup_Transfer_Unfinish_Hint" = "Transfer not completed. Connect phone and computer to the same network and continue backup.";
"Chatlog_Backup_Backup_Transfer_Lackspace_Warning" = "Insufficient computer storage. Reclaim space before proceeding";
"Chatlog_Backup_Backup_Transfer_Lackspace_Title" = "Backup ended due to insufficient computer storage";
"Chatlog_Backup_Backup_Transfer_Lackspace_Hint" = "%lld/%lld chat(s) backed up";
"Chatlog_Backup_Backup_Transfer_Terminate_Title" = "Backup completed";
"Chatlog_Backup_Backup_Transfer_Terminate_Hint" = "%lld/%lld chat(s) backed up";
"Chatlog_Backup_Backup_Transfer_UserCancel_Title" = "Backup Complete";
"Chatlog_Backup_Backup_Transfer_UserCancel_Desc" = "Data that has been backed up won't be cleared, but you will need to back it up again next time.";

// Chatlog recover
"Chatlog_Backup_Recover_Loading" = "Loading…";
"Chatlog_Backup_Recover_Record_Selection" = "Select chats to be recovered";
"Chatlog_Backup_Recover_Connecting_Title" = "Connecting phone…";
"Chatlog_Backup_Recover_Connecting_Desc" = "Connecting phone and computer to the same network";
"Chatlog_Backup_Recover_Connected_Title" = "Open WeChat on phone";
"Chatlog_Backup_Recover_Connected_Desc" = "Click OK to transfer";
"Chatlog_Backup_Recover_Prepare_Title" = "Preparing…";
"Chatlog_Backup_Recover_Prepare_Desc" = "For a more reliable network connection, do not close WeChat.";
"Chatlog_Backup_Recover_Transfer_Title" = "Transferring %lld/%lld chats (%@)";
"Chatlog_Backup_Recover_Transfer_Desc" = "For a more reliable network connection, do not close WeChat.";
"Chatlog_Backup_Recover_Finish_Title" = "Transfer completed. Continue restoring on phone.";
"Chatlog_Backup_Recover_Finish_Desc" = "Transferred %lld/%lld chats";
"Chatlog_Backup_Recover_Session_Title" = "Select chats to be recovered";
"Chatlog_Backup_Recover_Session_SelectAll" = "Select All";
"Chatlog_Backup_Recover_Session_Selected" = "%@ selected";
"Chatlog_Backup_Recover_Phone_FreeSize" = "Available: %@";

"Chatlog_Backup_Recover_Finish_Btn_Title" = "Done";
"Chatlog_Backup_Recover_Continue_Btn_Title" = "Continue";
"Chatlog_Backup_Recover_Terminate_Btn_Title" = "End";
"Chatlog_Backup_Recover_Retry_Btn_Title" = "Retry";
"Chatlog_Backup_Recover_Confirm_Btn_Title" = "OK";
"Chatlog_Backup_Recover_Cancel_Btn_Title" = "Cancel";
"Chatlog_Backup_Recover_Return_Btn_Title" = "Back";

"Chatlog_Backup_Recover_Transfer_Disconnect_Title" = "Transferring %lld/%lld chats (%@)";
"Chatlog_Backup_Recover_Transfer_Disconnect_Hint" = "Network disconnected. Connect phone and computer to the same network and continue transfer";
"Chatlog_Backup_Recover_Connect_Timeout_Title" = "Connection timeout. Try again.";
"Chatlog_Backup_Recover_Connect_Timeout_Hint" = "After connecting phone and computer to the same network";
"Chatlog_Backup_Recover_Transfer_Unfinish_Title" = "Transferred %lld/%lld chats…";
"Chatlog_Backup_Recover_Transfer_Unfinish_Hint" = "Phone and computer should connect to the same Wi-Fi to continue transferring chat logs.";
"Chatlog_Backup_Recover_Transfer_Lackspace_Warning" = "Insufficient phone storage. Reclaim space before proceeding";
"Chatlog_Backup_Recover_Transfer_Lackspace_Title" = "Transfer ended due to insufficient phone storage";
"Chatlog_Backup_Recover_Transfer_Lackspace_Hint" = "Transferred %lld/%lld个 chats";
"Chatlog_Backup_Recover_Transfer_Terminate_Title" = "Transfer ended";
"Chatlog_Backup_Recover_Transfer_Terminate_Hint" = "Transferred %lld/%lld个 chats";
"Chatlog_Backup_Recover_Transfer_UserCancel_Title" = "End";
"Chatlog_Backup_Recover_Transfer_UserCancel_Desc" = "If you stop the transfer, you will need to restore it again next time, but transferred chats won't be cleared.";
"Chatlog_Backup_Entrance_Recover_NoData_Title" = "No chats";
"Chatlog_Backup_Entrance_Recover_NoData_Desc" = "No backup to recover. Back up chats first.";

// Manage Exist Backup
"Chatlog_Backup_Manager_Exist_Backup_Name_Column_Title" = "Backup name";
"Chatlog_Backup_Manager_Exist_Backup_FirstBackupTime_Column_Title" = "First backup time";
"Chatlog_Backup_Manager_Exist_Backup_LastBackupTime_Column_Title" = "Last backup time";
"Chatlog_Backup_Manager_Exist_Backup_Operation_Column_Title" = "Operation";
"Chatlog_Backup_Manager_Recover_Backup_Selection_Window_Title" = "Select backups to recover";
"Chatlog_Backup_Manager_Exist_Backup_Selection_Window_Title" = "Manage";
"Chatlog_Backup_Manager_Exist_Backup_No_Backups" = "No backup yet";
"Chatlog_Backup_Manager_Exist_Backup_Delete_Alert_Title" = "Delete Backup";
"Chatlog_Backup_Manager_Exist_Backup_Delete_Alert_Message" = "Backup cannot be recovered once deleted. Delete now?";

// Chatlog entrance
"Chatlog_Backup_Entrance_Backup_Desc" = "Back up on Mac";
"Chatlog_Backup_Entrance_Recover_Desc" = "Restore on phone";
"Chatlog_Backup_Entrance_Manage_Desc" = "Manage Backup Files";
"Chatlog_Backup_Entrance_NotSupport_Desc" = "Backup not supported on the current version of mobile WeChat. Update to the latest version and try again.";
//"Chatlog_Backup_Entrance_NeedUpdate_Desc" = "Update mobile WeChat to ensure your usage";

// Login
"Login.WindowTitle" = "Log In";
"Login.ScanToLogin.Title" = "Scan to log in to WeChat";
"Login.DidScan.Title" = "Scanned Successfully";
"Login.ScanToLogin" = "Log in on phone to use WeChat on Mac";
"Login.Scan.Help" = "Open WeChat on your phone, then choose Discover > Scan QR Code.";
"Login.Not.On.WeChat" = "No WeChat yet?";
"Login.Waiting.Confirmation" = "Waiting for Confirmation";
"Login.ConfirmOnYourPhone" = "Confirm login on mobile WeChat";
"Login.LoggingIn" = "Logging in…";
"Login.LoggingInFirstTime" = "Logging in…";
"Login.Alert.Title" = "WeChat";
"Login.Alert.WrongUsrPass" = "Incorrect account or password. Enter again.";
"Login.Alert.OK" = "OK";
"Login.Refresh" = "Refresh";
"Login.Alert.UpdateCert" = "Your session has expired. Please sign in again";
"Login.SwitchAccount" = "Switch Account";

"Login.Intro.Heading" = "WeChat for Mac requires using your phone to sign in.\n";
"Login.Intro.Subheading" = "Please log in to Web WeChat";
"Login.Intro.StartButton" = "Log In";

"Login.Intro.ExplanationFormat" = "If you don't have WeChat on your phone, you can %@.";
"Login.Intro.ExplanationLinkText" = "learn more here";
"Login.Intro.ExplanationLinkURL" = "http://www.wechat.com/en/download.html";


"Login.AlphaVersion.Title" = "Beta Version";
//"Login.AlphaVersion.Description" = "You need to apply to use this beta version.";
"Login.AlphaVersion.Description" = "无法登录，只有受邀请的用户才可以登录该内测版本。";
"Login.AlphaVersion.Apply" = "Apply";
"Login.AlphaVersion.Cancel" = "Cancel";
"Login.Failed.WrongPassword" = "Unable to log in. Try again later.";

"Login.Initializing.Title" = "Confirmed";
"Login.Initializing.Data" = "Preparing login…";
"Login.Init.Failed.Title" = "WeChat";
"Login.Init.Failed.Desc" = "Unable to log in";
"Login.Failed.Key.Info" = "System busy. Log in again.";
"Login.AuthAnOtherPlace" = "Login timeout. Log in again.";
"Login.Alpha.Version.Error" = "Unable to sign in with this beta version. Download the official release from the App Store.";

// Tab
"Tabbar.Chats" = "Chats";
"Tabbar.Contacts" = "Contacts";
"Tabbar.Favorites" = "Favorites";
"Tabbar.OA" = "Official Accounts";

// Tab tooltips
"Tabbar.Chats.Tooltip" = "WeChat";
"Tabbar.Contacts.Tooltip" = "Contacts";
"Tabbar.Favorites.Tooltip" = "Favorites";
"Tabbar.OA.Tooltip" = "Reading";
"Tabbar.Preferences.Tooltip" = "Settings";

"Tabbar.Add.Chats.Tooltip" = "New Chat";
"Tabbar.Add.Fav.Tooltip" = "Favorite";

// Preferences
"Tabbar.Preferences.Settings" = "Settings";
"Tabbar.Preferences.ChatlogBackup" = "Backup and Restore";

// Global Menu
"Global.Menu.CheckForUpdates" = "Check for Updates…";
"Global.Menu.TechSupport" = "Technical Support";
"Global.Menu.ThirdPartySupport" = "Powered by third party";
"Global.Menu.Feedback" = "Feedback";

// Plugin
"Common_OfficialNickName" = "WeChat Team";
"Official_FileHelper_NickName" = "File Transfer";
"Official_BrandSessionHolder_NickName" = "Official Accounts"; // 后来把订阅号和服务号都放到一起了
"Official_Brand_Template_Msg_Holder_UserName" = "Service Notification";
"Contacts_Plugin_QQMail_Nickname" = "QQ Mail";
"Contacts_Plugin_QQOfflineMsg_Nickname" = "QQ Messages";
"Contacts_Plugin_PrivateMsg_Nickname" = "Weibo Messages";
"Contacts_Plugin_FloatBottle_Nickname" = "Message in a Bottle";
"Contacts_Plugin_FriendAssist_Nickname" = "New Friends";
"Contacts_Plugin_MediaNote_Nickname" = "Voice Notes";
"Contacts_Plugin_SyncAsist_Nickname" = "Contact Sync";
"Contacts_Plugin_LBS_Nickname" = "People Nearby";
"Contacts_Plugin_Shake_Nickname" = "Shake";
"Contacts_Plugin_Facebook_Nickname" = "Facebook";
"Contacts_Plugin_QQFriend" = "QQ Contacts";
"Contacts_Plugin_Reader" = "Tencent News";
"Contacts_Plugin_Album" = "Moments";
"Contacts_Plugin_MassSend" = "Broadcast Messages";
"Contacts_Plugin_Blog" = "Weibo Feeds";
"Contacts_Plugin_Voip"  = "Video Call";
"Contacts_Plugin_VoiceVoip" = "Voice Call";
"Contacts_Plugin_VoiceInput" = "Voice Input";
"Contacts_Plugin_GoogleContact" = "Google Contacts";
"Contacts_Plugin_LinkedIn" = "LinkedIn";

// Copyright
"copyright" = "Copyright © 2011-2017 Tencent. All Rights Reserved.";
"License_Agreement" = "Terms of Service";
"License_Link" = "http://www.wechat.com/en/service_terms.html";
"About_Version" = "Version. ";

// Settings
"Setting_Title" = "Settings";
"Setting.Section.General" = "General";
"Setting.Section.Stickers" = "Stickers";
"Setting.Section.Notifications" = "Notifications";
"Setting.Section.Shortcuts" = "Shortcuts";
"Setting.General.LogOut" = "Log Out";
"Setting.General.LogOut.Desc" = "Logging out this Mac will clear all local data.";
"Setting.General.LogOut.Wipe.Data" = "Log out and clear all data on this Mac";
"Setting.General.LogOut.Wipe.Data.And.History" = "Log out and clear all data on this Mac\n(including chat history)";
"Setting.General.NoWeChatID" = "No WeChat ID";
"Setting.General.Save.Chat.History" = "Save Chat History when Logging Out";

"Setting_Screen_Capture" = "Screenshot: ";
"Setting_Main_Panel" = "Show/Hide Panel: ";
"Setting_Recent_Unread" = "Go to latest unread message: ";
"Setting_Send_Message" = "Send Message: ";
"Setting_Notification" = "Message alert: ";
"Setting_Notification_Sound" = "Play sounds to notify login and new messages";
"Setting_Notification_Dock" = "Badge dock icon";
"Setting_Notification_Menubar" = "Show unread messages on menubar";
"Setting_Notification_Preview" = "Include preview text";
"Setting_File_Received" = "Save received file to: ";
"Setting_File_Picture" = "Save image to: ";
"Setting_File_Others" = "Other…";
"Setting_File_AutoDownload_Category" = "Auto-download: ";
"Setting_File_AutoDownload" = "Files sent in chats";
"Setting_SmallFavoriteFile_AutoDownload" = "Files in Favorites (<30 MB)";
"Setting_Restore_Defaults" = "Restore Default";
"Setting_Restore_LogOut" = "Log Out";
"Setting_Account" = "My Account";
"Setting_Download_Menu" = "Download Path: ";
"Setting_Download_Menu_Other" = "Other…";
"Setting_Menubar_Description" = "Show in menubar";
"Setting_Menubar_Always" = "Always";
"Setting_Menubar_NewMessage" = "New messages";
"Setting_Menubar_Never" = "Never";
"Setting_TextSize" = "Text Size: ";
"Setting_TextSize_ExampleGlyph_Small" = "A";
"Setting_TextSize_ExampleGlyph_Large" = "A";
"Setting_LockScreenShotcut" = "Lock: ";
"Setting_AccountInformation" = "Account Info: ";
"Setting_InformationFeedback" = "Feedback: ";
"Setting_SubmitFeedback" = "Submit Feedback";
"Setting_MsgRecord" = "Message History";
"Setting_GoToPreferences" = "Go to Preferences";
"Setting_MsgNotification" = "Notification: ";
"Setting_OpenScreenBannerNotification" = "Enable Banner Notification: ";
"Setting_OpenScreenBannerNotification_Remark" = "Enable screen banner notification in Preferences->Notification";
"Setting_FeedbackStatus_Success" = "Sent";
"Setting_FeedbackStatus_Fail" = "Unable to send";
"Setting_FeedbackContacts" = "可RTX联系andiezhang和kbchen反馈问题";

// Localizations Used by MASShortcutRecorder framework
// (CHECK THESE!)
"MASShortcut.Cancel" = "Cancel";
"MASShortcut.Delete.Shortcut" = "Delete Shortcut";
"keyboard shortcut" = "Shortcut";
"OK" = "OK";
"MASShortcut.Record.Shortcut" = "Record Shortcut";
"MASShortcut.Click.To.Record.New.Shortcut" = "Click to set new shortcuts";
"Shortcut cleared" = "Shortcut cleared";
"Shortcut set" = "Shortcut set";
"Space" = "Space";
"The key combination %@ cannot be used" = "The key combination %@ cannot be used";
"This combination cannot be used because it is already used by a system-wide keyboard shortcut.\nIf you really want to use this key combination, most shortcuts can be changed in the Keyboard & Mouse panel in System Preferences." = "This combination cannot be used because it is already used by a system-wide keyboard shortcut.\nIf you really want to use this key combination, most shortcuts can be changed in the Keyboard & Mouse panel in System Preferences.";
"This shortcut cannot be used because it is already used by the menu item ‘%@’." = "This shortcut cannot be used because it is already used by the menu item ‘%@’.";
"To record a new shortcut, click this button, and then type the new shortcut, or press delete to clear an existing shortcut." = "To record a new shortcut, click this button, and then type the new shortcut, or press delete to clear an existing shortcut.";
"MASShortcut.Type.New.Shortcut" = "Type New Shortcut";
"MASShortcut.Type.Shortcut" = "Type Shortcut";
"MASShortcut.Use.Old.Shortcut" = "Use Old Shortcut";


"Setting.StickerStore.StoreTab" = "Sticker Gallery";
"Setting.StickerStore.MyStickersTab" = "My Stickers";
"Setting.StickerStore.DownloadButton" = "Download";
"Setting.StickerStore.CantGetStoreError.Title" = "Unable to Connect To Sticker Gallery";
"Setting.StickerStore.CantGetStoreError.Description" = "Check network connection and try again.";

// Chat Sidebar Summary Badges
// Shows up when a non-text message gets sent
"Chats.Sidebar.Summary.Image" = "PHOTO";
"Chats.Sidebar.Summary.Voice" = "VOICE";
"Chats.Sidebar.Summary.Sight" = "SIGHT";
"Chats.Sidebar.Summary.Video" = "VIDEO";
"Chats.Sidebar.Summary.File" = "FILE";
"Chats.Sidebar.Summary.Sticker" = "STICKER";
"Chats.Sidebar.Summary.Namecard" = "CONTACT";
"Chats.Sidebar.Summary.Location" = "LOCATION";
"Chats.Sidebar.Summary.URL" = "LINK";
"Chats.Sidebar.Summary.Chat.Log" = "TRANSCRIPT";
"Chats.Sidebar.Summary.AppMsg" = "APP";
"Chats.Sidebar.Summary.News" = "NEWS";
"Chats.Sidebar.Summary.Metion" = "You were mentioned: ";

"Chats.Sidebar.DraftPrefix" = "[Draft] ";
"Chats.Sidebar.MuteGroupChatUnreadPrefix" = "[%d] ";

// Context Menu
"Chats.Menu.Delete" = "Delete";
"Chats.Menu.Delete.MacHelperMessages" = "Clear";
"Chats.Menu.Sticky" = "Sticky on Top";
"Chats.Menu.Unsticky" = "Unsticky";
"Chats.Menu.Mute" = "Mute Notifications";
"Chats.Menu.Unmute" = "Unmute";
"Chats.Menu.Rename" = "Rename";
"Chats.Menu.Leave" = "Leave Group";
"Chats.Menu.Profile" = "Show Contact";

// Menu Menu
"Main.Menu.Edit" = "Edit";
"Main.Menu.Copy" = "Copy";
"Main.Menu.Paste" = "Paste";

// Drag overlay
"Chats.SendToDragOverlay.Heading" = "Drop here to send to";
"Chats.SendToDragOverlay.SendToPersonFormat" = "Drop here to send to %@.";
"Chats.SendToDragOverlay.SendToPhone" = "Drop here to send to your phone.";

// Session Picker
"Session.Picker.Default.Heading" = "Choose Contact";
"Session.Picker.Chosen" = "%d people chosen";
"Session.Picker.Chosen.General" = "Selected";

// New Chat
"Chats.NewChat.Heading" = "New Chat";
"Chats.NewChat.ConfirmButton" = "Create";
"Chats.NewChat.Recent.Chats" = "Recent Chats";

// Message Type strings (used for notifications and other events)
"Message_type_pic" = "[Photo]";
"Message_type_draft" = "[Draft]";
"Message_type_mention" = "[You were mentioned]";
"Message_type_voice" = "[Voice]";
"Message_type_location" = "[Location]";
"Message_type_sys" = "[System Message]";
"Message_type_unknow" = "[Unknown]";
"Message_type_file" = "[File]";
"Message_type_card" = "[Contact Card]";
"Message_type_url" = "[Link]";
"Message_type_news" = "[News]";
"Message_type_appmsg" = "[App Message]";
"Message_type_Emoji" = "[Sticker]";
"Message_type_Video" = "[Video]";
"Message_type_Music" = "[Music]";
"Message_type_Book" = "[Book]";
"Message_type_Goods" = "[Product]";
"Message_type_Short_Video" = "[Sight]";
"Message_type_App_Record" = "[Transcript]";
"Message_type_Custom_Emoji" = "[Sticker]";
"Message_type_Note" = "[Note]";
"Message_type_unsupport" = "[Unknown Message]";
"Message_type_Voip" = "[Video call]";
"Message_type_Voip_Video" = " invites you to a video call";
"Message_type_Voip_Voice" = "invites you to a voice call";
"MessageContent_Voip"            = "[Voice Call]";
"MessageContent_VideoVoip"       = "[Video Call]";
"MessageContent_VideoVoipRemind" = "[Video Call]";
"Voip_Notification_Btn_Accept" = "Accept";
"Voip_Notification_Btn_Refuse" = "Decline";

"Voip_Notification_Btn_Click_For_Details" = "Click to view details";

// File Transfer
"File.Transfer.Start.Downloading" = "Downloading…";
"File.Transfer.Uploading" = "Uploading…";
"File.Transfer.Downloaded" = "Downloaded";
"File.Transfer.Download.Failed" = "Unable to download";
"File.Transfer.Download.Cancelled" = "Download cancelled.";
"File.Transfer.Uploaded" = "Sent";
"File.Transfer.Upload.Failed" = "Unable to send";
"File.Transfer.Upload.Cancelled" = "Sending cancelled";
"File.Transfer.Open" = "Open";
"File.Transfer.Cancel" = "Cancel";
"File.Transfer.Retry" = "Retry";
"File.Transfer.Error.TooBig.Header" = "File Exceeds Limit";
"File.Transfer.Error.TooBig.Body" = "Sorry, WeChat can only send files up to %d MB.";
"File.Transfer.Error.Empty.Header" = "Unable to send";
"File.Transfer.Error.Empty.Body" = "Unable to send as file size is 0 KB";
"File.Transfer.Error.Unsupported.Body" = "Unable to send this type of file";
"File.Transfer.FileNotExist.Header" = "File not found";
"File.Transfer.Download.FileNotExist.Body" = "File not found or deleted, download it again?";
"File.Transfer.Download.FileExpiredInServer.Body" = "File cleared. Unable to download.";
"File.Transfer.Download.FileNotExist.Confirm" = "Download";
"File.Transfer.Download.FileNotExist.Cancel" = "Cancel";
"File.Transfer.Download.NotStart" = "Download hasn't started.";
"File.Transfer.Button.Download" = "Download";
"File.Transfer.Forward.FileNotExist.Header" = "Unable to forward";
"File.Transfer.Forward.FileNotExist.Body" = "File not found or deleted. Unable to forward.";
"File.Transfer.Export.FileNotExist.Header" = "Unable to save";
"File.Transfer.Export.FileNotExist.Body" = "File not exist or deleted. Unable to save.";
"File.Transfer.Export.FileNotDownload.Header" = "Unable to save";
"File.Transfer.Export.FileNotDownload.Body" = "File not fully downloaded. Unable to save.";
"File.Transfer.Upload.Failed.Group.Chat.Format" = "File too large. Unable to send to a group with over %lu people.";

// Location Message
"LocationMessage.DefaultDescription" = "Location";
"LocationMessage.OpenInQQMaps" = "Open in Tencent Maps…";
"LocationMessage.OpenInAppleMaps" = "Open in Apple Maps…";
"LocationMessage.OpenInGoogleMaps" = "Open in Google Maps…";
"LocationMessage.OpenInMaps" = "Open in map…";

// System Message
"BrandContact.ReceiveMessage.Title" = "Receive Messages";
"BrandContact.ReceiveMessage.Message" = "Receive messages from this official account";

// Voip Message
"Voip_Connect_Most_Friend" = "Recent contacts";
"Not_Support_Vediovoip"       = "Sorry, your device does not support video calls.";
"Not_Support_Vediovoip_Receiver"    = "Friend has invited you to a video call but your device does not support this function";
"Voip_NoNetWork_Tips"          = "Network not available now. Check network.";
"Videovoip_Status_inviting"   = " invites you to a video call";
"Videovoip_Status_Calling"    = "Calling";
"Videovoip_Status_Connecting" = "Connecting";
"Videovoip_Status_Hangup"     = "Call ended";
"Videovoip_Status_Reject"     = "Call ended: request declined";
"Videovoip_Status_TimeOut"    = "Connection timed out";
"Videovoip_Status_BeHanguped" = "Call ended by other user";
"Videovoip_Status_CallFail"   = "Connection error";
"Videovoip_Status_Exception"  = "Call ended: network error";
"Videovoip_Status_WaitForAnswer" = "Awaiting response";
"Videovoip_Status_PeerNoAnswer"  = "Call wasn't answered";
"Videovoip_Status_PeerIsBusy"    = "Line busy";
"Videovoip_Status_Caller_CallFail" = "Call failed";
"Videovoip_Status_BeRejected"    = "Call ended: request declined";
"Videovoip_Status_CancelCall"    = "Call cancelled";
"Videovoip_Stauts_NotSupport"    = "This feature is only available on Wi-Fi network";
"Videovoip_Status_PeerVersion_NotSupport" = "Call failed: other user does not support video calls";
"Videovoip_Status_CheckContact_Error"     = "User hasn't added you to the Contacts. You can't start a video call now.";
"Videovoip_Status_Blacklist_Error"        = "Unable to start video call as you've been blocked by the other user.";
"Videovoip_Status_PeerPluginClose"        = "Call ended: your friend has disabled Video Call";
"Videovoip_Status_NetWorkError" = "Call ended: network error";
"Videovoip_Status_TalkBroken" = "Call is ended due to disconnection";
"Videovoip_Status_Caller_DetectCamera_Fail" = "No camera found. Try again later or switch to voice call.";
"Videovoip_Status_Receiver_DetectCamera_Fail" = "No camera found. Try again later or switch to voice call.";

"Voip_LocalNotification_Tips"   = "%@ invites you to a video call";
"VoiceVoip_LocalNotification_Tips" = "%@ invites you to a voice call";
"Cancel_LocalNotification_Tips" = "Missed call from %@";
"Normal_LocalNotification_Tips" = "You've got a WeChat message.";

"Voicevoip_Status_inviting"   = "invites you to voice call";
"Voicevoip_Status_PeerVersion_NotSupport" = "Unable to call: other user using a WeChat version that does not support Voice Calls";
"Voicevoip_Status_CheckContact_Error"     = "Unable to call because the other user is not your WeChat friend";
"Voicevoip_Status_Blacklist_Error"        = "Unable to call because you have been blocked by the other user";
"Voicevoip_Status_PeerPluginClose"        = "Unable to call: other user has disabled the Voice Call feature";
"Voicevoip_Status_BeRejected"    = "Other user has declined call request";

"VoipNetSattus_Bad_Tips" = "Unstable call connection";

"Videovoip_HangupBtnTitle"              = "Hang Up";
"Voice_SpeakerButton" = "Speaker";
"Voice_MicButton_Title" = "Close Mic";
"Voice_MicButton_Clicked_Title" = "Open Mic";

"Voip_NodeView_Status_NotConnected"     = "Call ended";
"Voip_NodeView_Status_Call_Complete"    = "Duration: %u%u:%u%u";
"Voip_NodeView_Status_Call_Interrupt"   = "Disconnected: %u%u:%u%u";
"Voip_NodeView_Status_Cancel" = "Cancelled";
"Voip_NodeView_Status_Remote_Cancel" = "Call cancelled by caller";
"Voip_NodeView_Status_Busy" = "Line busy";
"Voip_NodeView_Status_Call_Failed" = "Call failed";
"Voip_NodeView_Status_No_Answer" = "No answer";
"Voip_NodeView_Status_Remote_No_Answer" = "Call wasn't answered";
"Voip_NodeView_Status_Reject" = "Declined";
"Voip_NodeView_Status_Remote_Reject" = "Call declined by user";
"Voip_NodeView_Status_Not_Support" = "User can't accept calls";
"Voip_NodeView_Status_Connect_Failed" = "Unable to connect";
"Voip_NodeView_Status_Ignore" = "Ignored";


"Voip_AcceptByVoice"                = "Switch to Voice Call";
"Voip_SwtichToVoice"                = "Switch to Voice Call";
"Voip_AcceptCall"                   = "Accept";
"Voip_RejectCall"                   = "Decline";
"Voip_System_Msg_Content"           = "Video call: %@ %@";
"VoiceVoip_System_Msg_Content"      = "Voice Call: %@ %@";


"Voip_SendVideoCallInvite"          = "Message";
"Voip_CallFail_ForTimeLogic_Title"  = "Notice";

"Voip_LocalInviteMsgContent"        = "Are you free to have a video call?";
"VoiceVoip_LocalInviteMsgContent"   = "Are you free to have a voice call?";

"Voip_Audio_Device_Unplugin_Speaker" = "Voice will be played via speaker";
"Voip_Audio_Device_Unplugin_EarPhone" = "Audio via Speaker";
"Voip_Audio_Device_Unplugin_Speaker_Alert" = "Headphones disconnected. Audio now played via speaker.";
"Voip_Audio_Device_Unplugin_EarPhone_Alert" = "Headphones disconnected. Audio now played via speaker.";
"Voip_RotateScreen"                = "Rotate Screen";
"Voip_EndCall_Alert_Title"                = "End Call";
"Voip_EndCall_Alert_Message"              = "Closing windows will end the call";
"Voip_EndCall_Alert_CancelButton_Title"   = "Cancel";
"Voip_EndCall_Alert_ConfirmButton_Title"  = "End Call";
"Voip_Receiver_EndCall_Notification_Msg"  = "Call Ended";

//Voip Status Tips
"Voip_LocalVideoMode_For_Lower_Version" = "Waiting for the recipient's response";
"Voip_EarModeStatus_Tips"        = "Switched to voice call";
"Voip_RemoteVideoModeOpen_Tips"  = "Other user's camera turned on";
"Voip_RemoteEarMode_Tips" = "Other user's camera turned off";
"Voip_Loudspeaker_Off" = "Switched to voice call. Hold phone to your ear.";
"Voip_Loudspeaker_Off_Remote_Switch_To_Voice" = "Other user switched to voice call";
"Voip_Loudspeaker_Off_No_Mic" = "Switched to voice call";
"Voip_Loudspeaker_Off_Remote_Switch_To_Voice_No_Mic" = "Other user switched to voice call";
"Voip_LocalEarModeTips"     = "Camera turned off and other user cannot see you now";
"Voip_LocalVideoMode"       = "Camera turned on and other user can see you now";

"Voip_LocalBadNetwork" = "Switched to voice call due to poor network quality";
"Voip_RemoteBadNetwork" = "Switched to voice call because other user's network connection is weak";

"Voip_LocalBadNetwork_No_Mic" = "Switched to voice call due to poor network quality";
"Voip_RemoteBadNetwork_No_Mic" = "Switched to voice call because other user's network connection is weak";

"Voip_CallerView_Hangup" = "Cancel";
"Voip_Contact_Info_View_Button_Title" = "Video Call";
"VoiceVoip_Contact_Info_View_Button_Title" = "Voice Call";
"WeChatCall_Contact_Info_View_Button_Title" = "Video Call";

"Voip_RemoteEarMode_before_Answer" = "Other user switched to voice call";
"Voip_LocalEarMode_before_Answer" = "Switched to voice call";
"Voip_Remote_May_Not_Online" = "Other user may be busy. Try again later.";


"Voip_VideoView_Minimize_Tips" = "When minimized, video call will continue with camera on.";
"Voip_VoiceView_Minimize_Tips" = "Minimizing voice call enables Speaker Mode";
"Voip_Video_Conflict" = "Video call is on. Try again later.";
"Voip_Audio_Conflict" = "Voice call is on. Try again later.";
"Voip_CanStart_Video_Call" = "Unable to restart call after it's initialized";
"Voip_CanStart_Audio_Call" = "Unable to restart call after it's initialized";
"Voip_Status_Audio_Working_Tips" =  "Voice call in use. Tap to return.";
"Voip_Camera_Switch_Tips" = "Switch Camera";
"Voip_Ignore_Call" = "Ignore Call";
"Voip_Ignore_Alert_Message" = "Caller will not be notified of cancelled call when 'Ignore' is selected";
"Voip_Ignore_End_Message" = "Ignored incoming calls";

"Voip_Video_Minimize_Message" = "Video call minimized";
"Voip_Audio_Minimize_Message" = "Voice call minimized";
"Voip_Minimize_Button" = "Minimize";
"Voip_Interrupt_By_PhoneCall" = "Phone in call. Voice call ended.";
"Voip_Interrupt_By_OtherApp" = "Audio device in use. Call ended.";
"Voip_InPhoneCall_Conflict" = "Currently in phone call. Retry after call has ended.";

// Contacts Sidebar
"Contacts.Sidebar.All" = "Contacts";
"Contacts.Sidebar.Favorites" = "Starred";
"Contacts.Sidebar.GroupChats" = "Saved Groups";
"Contacts.Sidebar.Requests" = "New Friends";
"Contacts.Sidebar.OAs" = "Official Accounts";
"Contacts.Sidebar.Enterprise" = "Enterprise Account";
"Contacts.Sidebar.Tags" = "Tags";
"Contacts.Sidebar.Locations" = "Locations";
"Contacts.NickNameLabel" = "Alias";
"Contacts.FavoritesHeading" = "★ Starred";

// Contacts Context Menu
"Contacts.Menu.Message" = "Messages";
"Contacts.Menu.Call" = "Video Call";
"Contacts.Menu.Share" = "Send to Chat";
"Contacts.Menu.Delete" = "Delete";

// Contacts List
"Contacts.ContactList.Count.Singular" = "%d contacts";
"Contacts.ContactList.Count.Plural" = "%d contact";

// Emoticon Picker
"EmojiPicker.Category.QQ" = "Classic";
"EmojiPicker.Category.Human" = "Human";
"EmojiPicker.Category.Nature" = "Nature";
"EmojiPicker.Category.Objects" = "Objects";
"EmojiPicker.Category.Places" = "Places";
"EmojiPicker.Category.Symbols" = "Symbols";

"EmojiPicker.Gesture.SwipeHint" = "Enable slide gesture to view stickers quickly";
"EmojiPicker.Gesture.SwipeHintDetail" = "Set \"Swipe between pages\" gesture on settings";
"EmojiPicker.Gesture.IgnoreHint" = "Ignore";
"EmojiPicker.Gesture.HandleLater" = "Later";
"EmojiPicker.Gesture.HandleRightNow" = "Set Now";

"Emoticon.Favorite" = "Custom Stickers";
"EmojiPicker.Adding" = "Loading";
"EmojiPicker.Added" = "Added";
"EmojiPicker.Add.Fail" = "Unable to add";
"EmojiPicker.Touch.Limit" = "Maximum of stickers reached";
"EmojiPicker.Add.Timeout" = "Request timeout";

"EmojiPicker.Add.Fail.NeedPurchase" = "Paid sticker. Buy before adding it.";
"EmojiPicker.Add.Fail.NotValidArea" = "Sticker unavailable. Unable to add.";
"EmojiPicker.Add.Fail.Expired" = "Unable to add this sticker as it's unavailable";
"EmojiPicker.Add.Fail.NoSuchProduct" = "Unable to add this sticker";

// Group Chat Stuff
"CreateChatRoom.MsgFormat" = "You invited %@ to the group.";
"CreateChatRoom.MsgSeperate" = ", ";
"CreateChatRoom.DefaultTopic"	= "Group";
"ChatRoom.ReservedTopicNames"	= "Group Chat";
"ChatRoom.NeedVerify" = "%@ must be your friend to be invited to a group chat. Send them a friend request first.";
"ChatRoom.Panel_Choose_Contact" = "Select contacts";
"ChatRoom.Panel_Chosen_Num" = "%lu contact(s) selected";
"ChatRoom.Panel_Has_Add" = "Selected";
"ChatRoom.Delete_Member_Fail" = "Unable to delete this contact";
"ChatRoom.Delete_Self" = "You cannot remove yourself from the group.";

"ChatRoom.ChatRoomBeyondMax" = "You've already created the maximum number of groups";
"ChatRoom.TopicIllegal" = "Invalid group name";
"ChatRoom.Unkown_Failed" = "Unable to create group";
"ChatRoom.ChatRoomMemberBeyondMax" = "This group is full. Remove members first to add new ones.";
"ChatRoom.ChatRoomMemberNeedUpgrade" = "This group is full. Upgrade group capacity.";
"ChatRoom.NeedVerifyWait"  = "Your invitation to the group was sent. Please wait for the group owner's approval.";
"ChatRoom.NotExist" = "This group does not exist.";
"ChatRoom.Status_Error" = "You can't invite friends to the group as an error has occurred.";
"ChatRoom.Error_NoUser" = "%@ does not exist.";
"ChatRoom.Error_BlackList" = "%@ refused to join the group.";
"ChatRoom.Error_Verify" = "%@ isn't your WeChat friend yet. Add them first.";

"ChatRoom.Quit.Confirm.Heading" = "Leave Group Chat: %@";
"ChatRoom.Quit.Confirm.Message" = "You will no longer receive messages from this chat.";
"ChatRoom.Quit.Confirm.OK" = "Leave";

// Sticker Picker
"StickerPicker.CustomStickers" = "Custom";

// Compose Bar
"ComposeBar.PlaceholderString" = "Message";
"ComposeBar.EmoticonTooltip" = "Emoticons";
"ComposeBar.StickerTooltip" = "Emoticons";
"ComposeBar.AttachmentTooltip" = "Attachment";
"ComposeBar.VideoTooltip" = "Video Call";
"ComposeBar.VoiceTooltip" = "Voice Call";

"ComposeBar.ScreenshotText" = "Screenshot";
"ComposeBar.Attachment.MaxFileCount.Alert.Desc" = "Only the first %d attachments can be sent";

// Chat Unselected View
"Unselected.Wording" = "No chat selected";

// Message Context Menu
"Message.Menu.Copy" = "Copy";
"Message.Menu.Delete" = "Delete";
"Message.Menu.Forward" = "Forward";
"Message.Menu.Add.Emotion" = "Add sticker";
"Message.Menu.Browser" = "Open in Browser";
"Message.Menu.Copy.Link.Url" = "Copy URL";
"Message.Menu.Refresh" = "Refresh";
"Message.Menu.Service" = "Service";
"Message.Menu.Translate" = "Translate";
"Message.Menu.HideTranslation" = "Untranslate";
"Message.Menu.Favorites" = "Favorite";
"Message.Menu.Export" = "Save as…";
"Message.Menu.SaveAs" = "Save as…";
"Message.Menu.Recall" = "Recall";
"Message.Menu.Recall.Over.Two.Mins" = "Recall";
"Message.Menu.Resend" = "Resend";
"Message.Menu.Share.Extension" = "Share…";
"Message.Menu.Quote" = "Quote";
"Message.Menu.Debug.ViewSource" = " View XML";
"Message.Menu.Convert.To.Text" = "Convert to Text";
"Message.Menu.Wipe.Out.Text" = "Collapse";
"Message.Menu.Multiple.Select" = "Multiselect";
"Message.ErrorIndicator.Resend" = "Resend";

"Message.Notification.Mention" = "%@ mentioned you in group chat";

// Message Errors
"Message.Error.Convert.To.Text.Fail" = "Conversion failed";
// Message Multiple select
"Message.Multiple.Select.Forward" = "One-by-One Forward";
"Message.Multiple.Select.Merge.Forward" = "Combine and Forward";
"Message.Multiple.Select.Fav" = "Favorite";
"Message.Multiple.Select.Delete" = "Delete";
"Contacts.Can.Not.Share.LargeChatRoom.TipsFormat" = "File too large. Unable to send to a group with over %lu people.";

"Message.Multiple.Select.Undownload" = "Unable to forward and favorite non-downloaded stickers, images, videos and files from selected items";
"Message.Multiple.Select.NotAllowForword" = "Unable to forward audio, contact card, games, cards & offers, payment messages from selected items";
"Message.Multiple.Select.NotAllowFav" = "Unable to favorite stickers, contact cards, games, cards & coupons, records, payment tips, large files or other special messages from selected items";
"Message.Multiple.Select.Undownload.NotAllowForward" = "Unable to forward audios, contact cards, games, cards & coupons, payment tips or non-downloaded stickers, images, videos, and files from selected items";
"Message.Multiple.Select.Undownload.NotAllowFav" = "Unable to favorite stickers, contact cards, games, cards & coupons, records, payment tips or non-downloaded stickers, images, videos, and files from selected items";
"Message.Multiple.Select.NotAllow.MergeForward" = "Unable to combine and forward chat scripts, notes, large files, audios, contact cards, games, cards & coupons, and payment tips from selected items";

"Fav_Node_Name_Record" = "[Transcript]";
"Fav_Node_Name_Card" = "[Cards & Offers Message]";
"Fav_Node_Name_Emoji" = "[Sticker]";
"Fav_Node_Name_Pay" = "[Payment Message]";
"Fav_Node_Name_Not_Support" = "[Message Unsupported]";
"Fav_Node_Name_ShareCard" = "[Contact Card]";
"Fav_Record_Title" = "TRANSCRIPT";

// Message Delete
"Message.Delete.Confirm.Title" = "Delete Message";
"Message.Delete.Confirm.Description" = "Delete this message?";
"Message.Delete.Multiple.Confirm.Description" = "Delete selected message?";
"Message.Delete.Confirm.Action" = "Delete";

// Forward Message Sheet
"Message.ForwardSheet.Header" = "Forward Message";
"Message.ForwardSheet.Confirm" = "Forward";
"Message.ForwardSheet.ErrorHeader" = "Unable to Forward Message";
"Message.ForwardSheet.ErrorDescription" = "An error occurred forwarding the message.";
"Message.ForwardAlert.Header" = "Forward Message";
"Message.ForwardAlert.Description" = "Forward message to current chat?";

// Video Message Sheet
"Message.Video.ErrorHeader.Forward" = "Unable to forward";
"Message.Video.ErrorHeader.Copy" = "Unable to copy video";
"Message.Video.ErrorDescription.ShouldDownload" = "Download the video first";
"Message.Video.ErrorDescription.General" = "Unable to forward message";
"Message.Video.Compressing" = "Compressing…";

// Friend Request
"Friend.Request.Default.Content" = " wants to add you";
"Friend.Request.Accept" = "Accept";
"Friend.Request.Delete" = "Delete";
"Friend.Request.Added" = "Added";
"Friend.Request.View.Title" = "Friend Request";
"Friend.Request.Accept.ErrorHeader" = "Unable to add friend";

"Friend.Request.WaitingForConfirm" = "New request";
"Friend.Request.Greeting" = "Send Greeting";


// Friend Verify
"Friend.Verify.Message.Window.Title" = "Friend Verification";
"Friend.Verify.Message.Window.Hint" = "Send friend request to %@";
"Friend.Verify.Message.Window.Send" = "Send";
"Friend.Verify.Message.Window.Default.Message" = "I'm %@";
"Friend.Verify.Message.Window.Default.Message.Group.Chat" = "Hi, I'm \"%2$@\" from %1$@";


// Send Friend Request Dialog
"SendFriendRequest.Heading" = "Send Friend Request";
"SendFriendRequest.Prompt" = "Enter a greeting message:";
"SendFriendRequest.DefaultMsgFormat" = "I'm %@";
"SendFriendRequest.Send" = "Send";


// Unsupported Message
"Message.Unsupported" = "Unsupported message. View on phone.";

// Hongbao Message
"Message.Hongbao.Summary" = "[Red Packet]";
"Message.Hongbao.Send.Hint" = "[You've sent a red packet]";
"Message.Hongbao.Receive.Hint" = "[You've received a red packet. View on phone.]";
// Transfer Message
"Message.Transfer.Send.Summary" = "[Transfer] Await friend's receipt";
"Message.Transfer.Send.Hint" = "[You've made a transfer]";
"Message.Transfer.Send.Accept.Summary" = "[Transfer] You've confirmed receipt";
"Message.Transfer.Send.Accept.Hint" = "[You've received transfer]";
"Message.Transfer.Send.Reject.Summary" = "[Transfer] You've refunded transfer";
"Message.Transfer.Send.Reject.Hint" = "[You've refunded transfer]";
"Message.Transfer.Receive.Summary" = "[Transfer] Confirm receipt";
"Message.Transfer.Receive.Hint" = "[You've received a transfer. View on phone.]";
"Message.Transfer.Receive.Accept.Summary" = "[Transfer] Received by friend";
"Message.Transfer.Receive.Accept.Hint" = "[Received by friend]";
"Message.Transfer.Receive.Reject.Summary" = "[Transfer] Refunded by friend";
"Message.Transfer.Receive.Reject.Hint" = "[Refunded by friend]";

// Export
"Link.Export.Default.Title" = "Link";

// Debug Tools
"DebugTools.FeatureNotReady.Header" = "Coming Soon";
"DebugTools.FeatureNotReady.Body" = "This feature isn't ready yet.";
"DebugTools.Menu.CheckForUpdates" = "Check for Updates…";
"DebugTools.Menu.CheckForUpdates.DisabledDueToNetwork" = "Check for Updates… (needs OfficeWifi)";
"DebugTools.Menu.ReadReleaseNotes" = "Release Notes Blog";
"DebugTools.Menu.UploadLogs" = "Upload log files…";
"DebugTools.Menu.Filesystem" = "Filesystem";
"DebugTools.Menu.Filesystem.Library" = "Open Library (for this acct)";
"DebugTools.Menu.Filesystem.Cache" = "Open Cache (for this acct)";
"DebugTools.Menu.MarkAllAsRead" = "Mark All As Read";
"DebugTools.Menu.KitchenSink" = "Kitchen Sink";
"DebugTools.Menu.SwitchServer" = "Switch Server";


// Log Report
"LogReport.Description" = "Click below to upload your log to help us resolve your issue.";
"LogReport.Upload" = "Log Upload";
"LogReport.Uploading" = "Uploading…";
"LogReport.UploadFinished" = "Finished uploading. Thanks for the help!";
"LogReport.UploadFailed" = "Unable to upload log. Check network and try again.";
"LogReport.UploadDone" = "Done";

// Search
"Search.Comma" = ", ";
"Search.Include" = "Includes ";
"Search.GroupName" = "Group Name: ";
"Search.Nickname" = "Alias: ";
"Search.Username" = "WeChat ID: ";
"Search.Remark" = "Remark: ";
"Search.RemarkDescription" = "Remark: ";
"Search.City" = "City: ";
"Search.Province" = "Province: ";
"Search.Country" = "Country: ";
"Search.NoResults" = "No results";
"Search.Section.Contact" = "Sender";
"Search.Section.GroupChat" = "Group Chat";
"Search.Section.OA" = "Official Accounts";
"Search.Section.Favorite" = "Favorites";
"Search.Section.See.All.Format" = "See All (%d)";
"Search.Section.Fold" = "Fold";

//==== Favorites ====
"Favorites.Default.Title.Text" = "Text";
"Favorites.Default.Title.Video" = "Video";
"Favorites.Default.Title.Sight" = "Sight";
"Favorites.Default.Title.Image" = "Photo";
"Favorites.Default.Title.Voice" = "Voice";
"Favorites.Default.Title.WebPage" = "Link";
"Favorites.Default.Title.Location" = "Location";
"Favorites.Default.Title.Music" = "Music";
"Favorites.Default.Title.File" = "File";
"Favorites.Default.Title.Book" = "Book";
"Favorites.Default.Title.Product" = "Product";
"Favorites.Default.Title.TV" = "TV";
"Favorites.Default.Title.Card" = "Card";
"Favorites.Default.Title.Record" = "Transcript";
"Favorites.Default.Title.Record.Format" = "Transcript for %@";
"Favorites.File.Over.Limit.Title" = "Favorite File";
"Favorites.File.Over.Limit.Description" = "File too large. Unable to favorite.";
"Favorites.No.FavItems.Description" = "No favorited items";
"Favorites.No.FavItems.Add.Items.Tips" = "You can add chat scripts to Favorites";

// Forward Favorite Sheet
"Favorite.ForwardSheet.Header" = "Send Favorites Item";
"Favorite.ForwardSheet.Confirm" = "Send";
"Favorite.ForwardSheet.ErrorHeader" = "Unable to Forward Message";
"Favorite.ForwardSheet.ErrorDescription" = "System busy. Try again later.";
"Favorite.ForwardAlert.Header" = "Send";
"Favorite.ForwardAlert.Description" = "Are you sure you want to send to this chat?";

"Favorites.AddToFavoritesDragOverlay" = "Add to Favorites";
"Favorites.Via" = "From: ";
"Favorites.GroupChat.Default.Name" = "Group Chat";
"Favorites.Show.In.Fav" = "View in Favorites";
"Favorites.Usage.Format" = "Used %@ Available %@";

// Favorites Context Menu
"Favorites.Menu.Send.To.Friend" = "Send to Chat";
"Favorites.Menu.Copy" = "Copy";
"Favorites.Menu.Delete" = "Delete";
"Favorites.Menu.Download" = "Download";
"Favorites.Menu.Open.File" = "Open";
"Favorites.Menu.Export.File" = "Save as…";
"Favorites.Confirm.Delete.Title" = "Delete this from Favorites?";
"Favorites.Confirm.Delete.Title.Multiple" = "Delete %lu items from Favorites?";
"Favorites.Confirm.Delete.Desc" = "If you delete it, it will be gone from your account on all devices.";
"Favorites.Confirm.Delete.Desc.Multiple" = "If you delete these items, they will be gone from your account on all devices.";
"Favorites.Confirm.Delete" = "Delete";
"Favorites.Menu.View.Debug.XML" = " View XML";

"Favorites.Send.Heading.Singular" = "Send Favorite";
"Favorites.Send.Heading.Plural" = "Send %d Favorites";
"Favorites.Send.Button" = "Send";
// Error
"Favorites.Send.Error.Header" = "Unable to send";
"Favorites.Send.Error.SingleItem.Body" = "This item can't be sent until it has finished downloading.";
"Favorites.Send.Error.MultiItems.Body" = "These items can't be sent until they have finished downloading.";
"Favorites.Send.Error.MultiItems.WithNames.Body" = "Items still not downloaded: %@. Once finished, you can forward them.";
"Favorites.Send.Error.SingleItem.Waitting.Download.Body" = "Favorited item is downloading. Try again later.";
"Favorites.File.Export.Error.Header" = "Unable to save the file";
"Favorites.Open.Error.Header" = "Unable to open";
"Favorites.Open.Error.SingleItem.Waitting.Download.Body" = "Favorited item is downloading. Reopen later.";
"Favorites.File.Export.Error.Body" = "Download the file first";
"OA.Number.Over.Limit.Addcontact.Fail" = "Unable to follow";
"OA.Number.Over.Limit" = "Official account follow limit reached";
"Favorites.Record.Group.Forward.Title" = "Transcript for %@";


// Favorites sidebar
"Favorites.Sidebar.All" = "All Items";
"Favorites.Sidebar.PhotoItems" = "Photo";
"Favorites.Sidebar.URLItems" = "Link";
"Favorites.Sidebar.MusicItems" = "Music";
"Favorites.Sidebar.NoteItems" = "Note";
"Favorites.Sidebar.Tag" = "TAGS";
"Favorites.Sidebar.Senders" = "CONTACTS";
"Favorites.Sidebar.Chats" = "GROUPS";
"Favorites.Sidebar.FileItems" = "File";
"Favorites.Sidebar.ShowMore" = "View All";
"Favorites.Sidebar.Hide" = "Hide";


// Favorites Viewer Window
"Favorites.Viewer.Title.Template" = "%1$@ from %2$@"; // See http://stackoverflow.com/questions/1063843/is-there-a-way-to-specify-argument-position-index-in-nsstring-stringwithformat
"Favorites.Viewer.Action.Forward" = "Forward";
"Favorites.Viewer.Action.Delete" = "Delete";
"Favorites.Viewer.Action.Export" = "Save as…";
"Favorites.Viewer.Action.SaveAs" = "Save as…";
"Favorites.Viewer.Action.OpenInBrowser" = "Open in Browser";
"Favorites.Viewer.Action.AddToFavorites" = "Add to Favorites";
"Favorites.Viewer.Action.Share" = "Share";
"Favorites.Viewer.Action.Forwar.Failed.Title" = "Forward Error";
"Favorites.Viewer.Action.Forwar.Failed.Message" = "Unable to forward this item as it didn't finish downloading.";
"Favorites.Viewer.Action.Previous.Item" = "Previous";
"Favorites.Viewer.Action.Next.Item" = "Next";
"Favorites.Viewer.Action.OpenWith" = "Open with default app";
"Favorites.Viewer.Action.OpenWith.CustomApp" = "Open with \"%@\"";
"Favorites_Video_Time_Min" = "%02lu:%02lu";
"Favorites_Video_Time_Sec" = "00:%02lu";

"Favorites.Note.UnKnowType" = "Unable to view content using current version";
"Favorites.Note.UpdateTips" = "Update to the latest version of WeChat";
"Favorites.Note.Downloading" = "Loading";

"Fav.Record.Single.Forward.Title" = "Chat History for %@ and %@";
"Fav.Record.Group.Forward.Title.New" = "%@, %@ and %@";
"Fav.Record.Group.Forward.Title" = "Transcript for %@";
"Contacts.GroupCard"			= "Group";
"Fav_Record_SubItem_Time" = "%d-%d-%d %@"; //2014-2-18 下午5:08
"Fav_Record_Group_Forward_Title_New" = "%@, %@ and %@";
"Fav_Record_Group_Forward_Title_Count" = "%u people";
"Fav_Record_Forward_Voice_CannotPlay" = "Forwarded voice cannot be played";

"Fav_Node_Img_Title" = "[Photo]";
"Fav_Node_Location_Title" = "[Location] %@";
"Fav_Node_Voice_Title" = "[Voice]";
"Fav_Node_Emoji_Title" = "[Sticker]";
"Fav_Node_Video_Title" = "[Video]";
"Fav_Node_File_Title" = "[File] %@";
"Fav_Node_Music_Title" = "[Music] %@";
"Fav_Node_Goods_Title" = "[Goods] %@";
"Fav_Node_TV_Title" = "[TV] %@";
"Fav_Node_URL_Title" = "[URL] %@";
"Fav_Node_Sight_Title" = "[Sight]";

//WeNote
"WeNote_Default_Title" = "Add Title";
"WeNote_Update_Time" = "Last edit at ";
"WeNote_Recording" = "Recording";
"WeNote_Downloading" = "Loading";
"WeNote_UnknownType" = "Unable to view this content in current version";
"WeNote_UpdateTips" = "Update to the latest version of WeChat";
"WeNote_Conflict_Prefix" = "Conflicting Change";
"WeNote_Conflict" = "Conflicting Change (%lu-%lu-%lu)";
"OpenApi_MainItem_Note" = "[Note]";
"WeNote_Message_Default_Title" = "Note";
"WeNote_Fav_Icon_Text" = "Favorite";
"WeNote_Total_Image_Count" = "(%lu)";

// Date
"Favorites.Date.Today" = "Today";
"Favorites.Date.This.Week" = "This Week";

// Search
"Favorites.Search.Section.Header.Content" = "Content";
"Favorites.Search.Section.Header.Sender" = "Sender";
"Favorites.Search.Section.Header.GroupChat" = "Group Chat";
"Favorites.Search.Result.Number.Singular" = "(1 Result)";
"Favorites.Search.Result.Number.Multiple" = "(%d Results)";
// SenderInfo
"Favorites.SenderInfo.NickName.Prefix" = "From: ";

//收藏容量
"Fav_Capacity_Title" = "Clear Favorites Storage";
"Fav_Capacity_Alert_NotEnough_Title" = "Insufficient Storage";
"Fav_Capacity_Alert_NotEnough_Content" = "Unable to use Favorites. Reclaim some space and try again.";
"Fav_Capacity_Detail" = "Details";
"Fav_Capacity_Nearly_UsedUp" = "Insufficient storage. Reclaim some space and try again.";
"Fav_Capacity_Already_UsedUp" = "Unable to upload contents due to insufficient storage. Reclaim some space and try again.";
"Fav_Capacity_Left" = "Available: ";
"Fav_Capacity_Choosen" = "Reclaim: ";
"Fav_Capacity_Delete_Tip" = "Selected items cannot be recovered once deleted. Delete now?";

// Message Unread Tips
"Message.Unread.TipsSingular" = "1 new message";
"Message.Unread.TipsPlural" = "%d new messages";
"Message.Unread.DividerText" = "Below are new messages";

// Official Account
"OA_Read_More" = "Read More";

// Time
"Util_Today" = "Today";
"Util_Yesterday" = "Yesterday";
"Util_Sunday" = "Sunday";
"Util_Monday" = "Monday";
"Util_Tueday" = "Tuesday";
"Util_Wedday" = "Wednesday";
"Util_Thuday" = "Thursday";
"Util_Friday" = "Friday";
"Util_Satday" = "Saturday";
"Util_Daybreak"  = "am";
"Util_Morning"   = "am";
"Util_Noon"      = "pm";
"Util_Afternoon" = "noon";
"Util_Evening"   = "night";

// Name Card
"Message.Name.Heading" = "NAME CARD";
"Message.Name.Heading.Official.Account" = "OFFICIAL ACCOUNT";
"Message.Name.GroupChatInviteHeading" = " invites you to a group";
"Message.Name.Card.Added" = "Added";
"Message.Name.Card.NotFriendYet" = "Not friend yet";
"Message.Name.Card.AddButton" = "Add";
"Message.Name.Card.MessageButton" = "Message";
"Message.Name.Card.OpenGroupButton" = "Messages";
"Message.Name.Card.JoinGroupButton" = "Join Group";
"Message.Name.Card.GroupAlreadyJoined" = "Already a member";
"Message.Name.Card.GroupNotYetJoined" = "Not a member yet";

"Message.Reader.ReadMore" = "Read More";
"Message.Recall.Failed" = "Unable to recall the message. Check your network.";
"Message.Recall.Succ" = "You've recalled a message.";

"Message.Translate.Failed.Heading" = "Unable to translate";
"Message.Translate.Failed.Default" = "Try again later.";
"Message.Translate.Failed.Text.Over.Limit" = "This text is too long and cannot be translated.";
"Message.Translate.Finish" = "Translated";

"Message.Input.Too.Long.Title" = "Text Too Long";
"Message.Input.Too.Long.Content" = "This message is too long to send.";

"Message.Draft.Photo" = "[Photo]";

// Chat Inspector
"ChatInspector.Sticky" = "Sticky On Top";
"ChatInspector.Favorite" = "Starred";
"ChatInspector.Mute" = "Mute";
"ChatInspector.Share" = "Share";
"ChatInspector.LeaveChat" = "Leave";
"ChatInspector.ShowNames" = "On-screen Names";
"ChatInspector.Send.Message" = "Message";
"ChatInspector.Add.Contact" = "Add Contact";

"ChatInspector.ActionMenu.Invite" = "Invite People…";
"ChatInspector.ActionMenu.GroupQRCode" = "Group QR Code";

"ChatInspector.AddMembers.Title" = "Add to Chat";
"ChatInspector.AddMembers.Confirm" = "Add";
"ChatInspector.AddMembers.Back" = "Chat";

"ChatInspector.InviteMembers.Title" = "Invite to Chat";
"ChatInspector.InviteMembers.Confirm" = "OK";
"ChatInspector.InviteMembers.Back" = "Back";

"ChatInspector.ShareIndNamecard.Title" = "Share Contact Card for %@";
"ChatInspector.ShareIndNamecard.Confirm" = "Send";
"ChatInspector.ShareIndNamecard.Back" = "Back";

"ChatInspector.QRCode.Heading" = "Group QR Code";
"ChatInspector.QRCode.Title" = "Share Group QR Code";
"ChatInspector.QRCode.Description" = "Drag and drop it in a flyer, email, or anywhere people will see it!";
"ChatInspector.QRCode.SaveButton" = "Save";
"ChatInspector.QRCode.RevokeButton" = "Revoke";

// Group Chat Inspector
"GroupChatInspector.UpdateChatName" = "Rename";
"GroupChatInspector.UpdateNickName" = "Change group alias";

// Chat Info Panel
"ChatInfoPanel.Add.Member" = "Add Member";
"ChatInfoPanel.Remove.Member" = "Remove Member";
"ChatInfoPanel.LeaveChat" = "Leave";
"ChatInfoPanel.Loading" = "Loading…";
"ChatInfoPanel.Removed" = "Removed";
"ChatInfoPanel.Added" = "Added";
"ChatInfoPanel.Failed" = "System busy. Try again later.";
"ChatInspector.Save.To.Address.Book" = "Save to Contacts";
"ChatInfoPanel.Add.Member.Confirm" = "Add";
"ChatInfoPanel.Remove.Member.Confirm" = "Delete";

//Chat Detail Panel
"ChatDetailPanel.GroupChatName" = "Group Name";
"ChatDetailPanel.GroupChatNamePlaceHolder" = "Tap to edit group name";
"ChatDetailPanel.GroupChatAnnounce" = "Group Notice";
"ChatDetailPanel.GroupChatAnnounce.NotOwnerPlaceHolder" = "No group notice yet";
"ChatDetailPanel.GroupChatAnnounce.OwnerPlaceHolder" = "Tap to set a group notice";
"ChatDetailPanel.GroupChat.AddMember" = "Add Member";
"ChatDetailPanel.GroupChat.RemoveMember" = "Remove Member";
"ChatDetailPanel.LeaveGroupChat" = "Leave";
"ChatDetailPanel.Announcenment.Cancel" = "Cancel";
"ChatDetailPanel.Announcenment.Confirm" = "Publish";
"ChatDetailPanel.Loading" = "Loading…";
"ChatDetailPanel.Removed" = "Removed";
"ChatDetailPanel.Removed.Fail" = "Unable to delete";
"ChatDetailPanel.Added" = "Added";
"ChatDetailPanel.Failed" = "System busy. Try again later.";
"ChatDetailPanel.Announcement.AtAll" = "@All";
"ChatDetailPanel.NoAnnouncement.Hint" = "No content";
"ChatDetailPanel.NoAnnouncement.Description" = "Only owner can change group notice";
"ChatDetailPanel.Announcement.SaveFail" = "Save Group Notice";

// Contact Inspector:
"Contacts.Inspector.LocationKeyLabel" = "Region";
"Contacts.Inspector.SourceKeyLabel" = "From ";
"Contacts.Inspector.NickNameLabel" = "Alias";
"Contacts.Inspector.RemarkValueLabelPlaceHolder" = "Set Remarks";
"Contacts.Inspector.ToolTips.SendMessage" = "Messages";
"Contacts.Inspector.ToolTips.ShareNameCard" = "Share Name Card";
"Contacts.Inspector.ToolTips.AddToContact" = "Add";
"Contacts.Inspector.ToolTips.ViewHistoryMessage" = "View Message History";
"Contacts.Inspector.ToolTips.AddBizContact" = "Follow";

"Contacts.UserNameKeyLabel" = "WeChat ID";
"Contacts.LocationKeyLabel" = "Location";
"Contacts.DescriptionKeyLabel" = "Remarks";
"Contacts.StatusKeyLabel" = "What's Up";
"Contacts.BrandIntroKeyLabel" = "Intro";
"Contacts.SourceKeyLabel" = "Source";
"Contacts.GroupChatNameLabel" = "Group Name";
"Contacts.TagKeyLabel" = "Tags";
"Contacts.RemarkKeyLabel" = "Remarks";
"Contacts.Header.Profile" = "PROFILE";
"Contacts.Header.MyNotes" = "MY NOTES";
"Contacts.Header.Favorites" = "FAVORITES";
"Contacts.Value.NoneSet" = "Not Set";
"Contacts.EnterChat" = "Messages";
"Contacts.GroupChat.SendMsg" = "Enter Group";
"Contacts.GroupChat.Remove" = "Remove from Contacts";
"Contacts.SendMsgToBrankContact" = "View Message History";

"Contacts.CardInspector.Action.Message" = "Message";
"Contacts.CardInspector.Action.Favorite" = "Starred";
"Contacts.CardInspector.Action.ShareNamecard" = "Share Contact Card";
"Contacts.CardInspector.Action.Delete" = "Deleting…";
"Contacts.SourceList.Tag.Delete" = "Delete";
"Contacts.SourceList.Tag.Rename" = "Rename";

"Contacts.Delete.Title.Format" = "Delete %lu contacts?";
"Contacts.Delete.Description" = "If you proceed, they will be permanently removed from your Contacts.";
"Contacts.Delete.Title.Format.Multiple" = "Delete %lu contacts?";
"Contacts.Delete.Description.Multiple" = "If you proceed, they will be permanently removed from your Contacts.";


// Contact UI Add Scene / Source
"Contacts_Source_Shake"			= "Shake";
"Contacts_Source_LBS"			= "People Nearby";
"Contacts_Source_QRCode"        = "Scan QR Code";
"Contacts_Source_Chatroom"      = "Added from Group";
"PushContactLBS"                     = "From People Nearby";
"PushContactShake"					 = "From Shake";
"PushContactBottle"					 = "From Message in a Bottle";
"PushContactQRCode"                  = "From Shake";
"PushContactGoogleContact"           = "Google Contacts";
"PushContactRadar"           = "Friend Radar";
"PushContacPush"                  = "New Friends";

// Share Namecard Sheet
"ShareNameCard.Heading" = "Share \"%@\" to:";
"ShareNameCard.Confirm" = "Send";

// Group Chat
"CreateChatRoom_MsgFormat" = "You invited %@ to the group.";
"CreateChatRoom_MsgSeperate" = ", ";
"CreateChatRoom_DefaultTopic"	= "Group";
"ChatRoom_ReservedTopicNames"	= "Group Chat";
"ChatRoom_NeedVerify" = "%@ must be your friend to be invited to a group chat. Send them a friend request first.";
"ChatRoom_Panel_Choose_Contact" = "Select contacts";
"ChatRoom_Panel_Chosen_Num" = "%lu contact(s) selected";
"ChatRoom_Panel_Has_Add" = "Selected";
"ChatRoom_Delete_Member_Fail" = "Unable to delete this contact";
"ChatRoom_Delete_Self" = "You cannot remove yourself from the group.";
"ChatRoom_ChatRoomBeyondMax" = "You've already created the maximum number of groups";
"ChatRoom_TopicIllegal" = "Invalid group name";
"ChatRoom_Unkown_Failed" = "Unable to create group.";
"ChatRoom_ChatRoomMemberBeyondMax" = "This group is full. Remove members first to add new ones.";
"ChatRoom_ChatRoomMemberNeedUpgrade" = "This group is full. Upgrade group capacity.";
"ChatRoom_NeedVerifyWait"  = "Your friend invitation to the group has been sent. Please wait for the group owner's approval.";
"ChatRoom_NotExist" = "This group does not exist.";
"ChatRoom_Status_Error" = "You can't invite friends to the group as an error has occurred";
"ChatRoom_Error_NoUser" = "%@ does not exist";
"ChatRoom_Error_BlackList" = "%@ refused to join the group.";
"ChatRoom_Error_Verify" = "%@ isn't your WeChat friend yet. You should add them first.";
"NewMessage_ContactBeyondMaxTitle_Admin"= "Group is full. Learn more?";
"NewMessage_ContactBeyondMaxTitle"= "No more contacts can be selected";
"NewMessage_IlegalTopic"	     = "Invalid topic. Try another.";

// Group Chat Invitation
"Group.Chat.Invitation.Error.Title" = "Join Group";
"Group.Chat.Members.Error.Title" = "Add Member";
"Group.Chat.Members.Over.Limit" = "No more contacts can be selected";
"Group.Chat.Members.Illegal.Topic" = "Invalid topic. Try another.";
"Group.Chat.Members.Need.Verify" = "Submitted a friend invitation. Awaiting group owner's approval.";
"Group.Chat.Members.Not.Exist" = "Group does not exist";
"Group.Chat.Members.Status.Error" = "Unable to invite friends to join this group";
"Group.Chat.Members.Group.Chat.Owner.To.Invite" = "Group is full. Owner (%@) can increase group capacity up to %lu members.";
"Group.Chat.Members.Invite.Now" = "Group has many members. A new user needs to accept your invitation to join the group. Invite now?";
"Group.Chat.Members.Invite" = "Invite";
"Group.Chat.Members.Unknown.Issue" = "System busy. Try again later.";

// Viewer Window
"ViewerWindow.Title.Photo" = "Photo";

// YO Message
"Yo.Message.Description" = " is looking for you";

// Lock Screen
"Lock.Title" = "WeChat is locked.";
"Lock.Description" = "You can unlock on the toolbar at the top of WeChat session";
"Lock.Log.Out" = "Log Out";
"Lock.Title.Network" = "No network connection";
"Lock.Description.Network" = "WeChat will re-connect when network detected";
"Lock.Open.Mac.Helper" = "Unlock on Phone";
"Lock.Title.Network.Login" = "Network Disconnected";
"Lock.Description.Network.Login" = "Check network and try again";
"Lock.Description.Network.Banner" = "Network unavailable. Check and try again.";

// Mac Helper
"MacHelper.Active.Message" = "You are logged in on %@";
"MacHelper.Main.Device.Name.Default" = "My Phone";
"MacHelper.Default.Message" = "You can send messages and files to your phone in this chat.";

// Harcode Contacts
"Official_MacHelper_NickName" = "My Phone";

// Notification
"Notification.Receive.Message" = "You've received a message";

// Debug Strings
"Debug.Upload.Dump.Log" = "Upload performance log";
"Debug.Upload.Success" = "Uploaded";
"Debug.Upload.Uplloading" = "Uploading…";
"Debug.Upload.Failed" = "Unable to upload. Try again later.";

// MMPreview Panel
"PreviewPanel.Default.File.Name" = "Unnamed file";

// OA Message
"OAMessage.No.Article" = "No new articles";

"TechSupport.Jietu.Title" = "Jietu";
"TechSupport.Jietu.Desc" = "Powered by Jietu. \"Jietu\" is a free screenshot app that features an easy-to-use interface.";

// Chat Record
"ChatRecord.Video.Duration" = "%u second(s)";

// Whats New
"WhatsNew.title" = "WeChat for Mac 2.2";
"WhatsNew.desc" = "1. Backup phone chat logs to your Mac.\n2. Translate chat messages into your interface language.\n3. Improved search feature.";
// Image Message Cell View
"Message.Image.Loading" = "Loading…";
